// -Дан масив['a', 'b', 'c'].Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу. -
//   Дан масив[1, 2, 3].Зробіть з нього новий масив[3, 2, 1]. -
//   Дан масив[1, 2, 3].Додайте йому в кінець елементи 4, 5, 6. -
//   Дан масив[1, 2, 3].Додайте йому в початок елементи 4, 5, 6.


// let arr = ['a', 'b', 'c'];

// for(let i = 1; i <= 3; i++){
//   arr.push(i);
// }

// console.log(arr)

// ___________________________________________________________________-

// const arr = [1, 2, 3];
// const arr2 = arr.reverse();
// console.log(arr2)

// ____________________________________________________________________

// const arr = [1, 2, 3];

// for(let i = 4; i <= 6; i++){
//   arr.push(i);
// }

// console.log(arr)

// ___________________________

// const arr = [1, 2, 3];

// for (let i = 4; i <= 6; i++) {
//   arr.unshift(i);
// }

// console.log(arr)

// -Дан масив[1, 2, 3, 4, 5].Перетворіть масив в[4, 5]. -
//   Дан масив[1, 2, 3, 4, 5].Перетворіть масив в[1, 2]. -
//   Дан масив[1, 2, 3, 4, 5].Зробіть з нього масив[1, 2, 3, 'a', 'b', 'c'].

//   const arr = [1, 2, 3, 4, 5];

// const arr2 = arr.splice(0, 3);
// console.log(arr)

// const arr2 = arr.slice(3, arr.length);
// console.log(arr2)

// _____________________________________________________

// const arr = [1, 2, 3, 4, 5];

// const arr2 = arr.slice(0, 2);
// console.log(arr2)

// _______________________________

// const arr = [1, 2, 3, 4, 5];
// let arr2 = arr.slice(0, 3);

// arr2.push('a', 'b', 'c');

// console.log(arr2)

// -Взяти масив з 10 чисел або створити його.Вивести в консоль тільки ті елементи, значення яких є парними.

// let arr = [];

// for(let i = 1; i <= 10; i++){
//   arr.push(i)
// }

// for(el of arr){
//   if (el % 2 === 0){
//     console.log(el)
//   }
// }

// -Взяти масив з 10 чисел або створити його.Створити 2 й порожній масив.За допомогою будь - якого циклу скопіювати значення одного масиву в інший.

// let arr = [];

// for(let i = 1; i <= 10; i++){
//   arr.push(i)
// }

// let arr2 = [];

// for(el of arr){
//   arr2.push(el)
// }

// console.log(arr2);

// -Дано масив: ['a', 'b', 'c'].За допомогою циклу
// for зібрати всі букви в слово. -
//   Дано масив: ['a', 'b', 'c'].За допомогою циклу
// while зібрати всі букви в слово. -
//   Дано масив: ['a', 'b', 'c'].За допомогою циклу
// for of зібрати всі букви в слово. -
//   Дано масив: ['a', 'b', 'c'].За допомогою циклу
// for of зібрати всі букви в слово.

// let str = '';
// const arr = ['a', 'b', 'c'];
//  for(let i = 0; i < arr.length; i++){
//      str += arr[i];      
//  }
//  console.log(str);

// _______________________________________________________

// let str = '';
// const arr = ['a', 'b', 'c'];
// let i =  0;
//  while(i < arr.length){
//    str += arr[i]
// i++
//  }
//  console.log(str);

// __________________________________________________________

// let str = '';
// const arr = ['a', 'b', 'c'];
//  for(const el of arr){
//      str += el;      
//  }
//  console.log(str);


// зробити масив з 10 чисел[2, 17, 13, 6, 22, 31, 45, 66, 100, -18] та:
//   1. перебрати його циклом
// while
// 2. перебрати його циклом
// for
// 3. перебрати циклом
// while та вивести числа тільки з непарним індексом
// 4. перебрати циклом
// for та вивести числа тільки з непарним індексом
// 5. перебрати циклом
// while та вивести числа тільки парні значення
// 6. перебрати циклом
// for та вивести числа тільки парні значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання(окрім 8), але в зворотньому циклі(с заду на перед)
// 10
// створити пустий масив та:
//   -заповнити його 50 парними числами за допомоги циклу. -
//   заповнити його 50 непарними числами за допомоги циклу.

//1 __________________________________________________
// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// let i = 0;
// while (i < arr.length) {
//   console.log(arr[i]);
//   i++
// }
// ++++++++++++++++++++++++++++++++++++++++++++++++++

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// let i = arr.length-1;
// while (i >= 0) {
//   console.log(arr[i]);
//   i--
// }

// 2_________________________________________________--

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// for(let i = 0; i < arr.length; i++){
//   console.log(arr[i])
// }

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// for(let i = arr.length-1; i >= 0; i--){
//   console.log(arr[i])
// }

//3 _________________________________________________________

//  const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

//  let i = 0;
//  while (i < arr.length) {
//    if(i % 2 !== 0)
//   console.log(arr[i])
//    i++
//  }

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//  const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

//  let i = arr.length-1;
//  while (i > 0) {
//    if(i % 2 !== 0)
//   console.log(arr[i])
//    i--
//  }
// 4____________________________________________________________

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// for (let i = 0; i < arr.length; i++) {
//   if (i % 2 !== 0) {
//     console.log(arr[i])
//   }
// }

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// for (let i = arr.length-1; i >= 0; i--) {
//   if (i % 2 !== 0) {
//     console.log(arr[i])
//   }
// }


// 5_________________________________________________________

//  const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

//  let i = 0;
//  while (i < arr.length) {
//    if(i % 2 === 0)
//   console.log(arr[i])
//    i++
//  }

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//  const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

//  let i = arr.length-1;
//  while (i >= 0) {
//    if(i % 2 === 0)
//   console.log(arr[i])
//    i--
//  }

// 6____________________________________________________________

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// for (let i = 0; i < arr.length; i++) {
//   if (i % 2 === 0) {
//     console.log(arr[i])
//   }
// }

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// for (let i = arr.length-1; i >= 0; i--) {
//   if (i % 2 === 0) {
//     console.log(arr[i])
//   }
// }

//7 ____________________________________________________________

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let arr2 = [];
// for (let i = 0; i < arr.length; i++) {
//   if (arr[i] % 3 === 0) {
//     arr[i] = 'okten'
//   }
//   arr2.push(arr[i])
// }
// console.log(arr2);

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let arr2 = [];
// for (let i = arr.length-1; i >= 0; i--) {
//   if (arr[i] % 3 === 0) {
//     arr[i] = 'okten'
//   }
//   arr2.push(arr[i])
// }
// console.log(arr2);

// 8____________________________________________________________

//  const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

//  arr.reverse();
//  console.log(arr);
// 10 1_____________________________________________________________

// let arr2 = [];
// for (let i = 0; i <= 50; i++) {
//   if (i % 2 === 0) {
//     arr2.push(i)
//   }

// }
// console.log(arr2);

//10 2 _______________________________________________________________

// let arr2 = [];
// for (let i = 0; i <= 50; i++) {
//   if (i % 2 !== 0) {
//     arr2.push(i)
//   }

// }
// console.log(arr2);

// 1. Створити пустий масив та:
//   a.заповнити його 50 парними числами за допомоги циклу.
// b.заповнити його 50 непарними числами за допомоги циклу.
// c.Заповнити масив 20 ма рандомними числами.(Google: Generate random number JS)
// d.Заповнити масив 20 ма рандомними чисалами в діапазоні від 8 до 732(Google: Generate random number JS)
// 2. Вивести за допомогою console.log кожен третій елемен
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [1, 2, 3, 5, 7, 9, 56, 8, 67] - > Має бути виведено 1, 9, 56
// 6. Є масив з числами[100, 250, 50, 168, 120, 345, 188], Які характеризують вартість окремої покупки.Обрахувати середній чек.

// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями(стрінги, числа, і тд...).пройтись по ньому, і якщо елемент є числом - додати його в інший масив.


// a____________________________________________________

// let arr = [];
// for (let i = 1; i <= 100; i++) {
//   if (i % 2 === 0) {
//     arr.push(i);
//   }
// }

// console.log(arr);

// b_______________________________________________________

// let arr = [];
// for (let i = 1; i <= 100; i++) {
//   if (i % 2 !== 0) {
//     arr.push(i);
//   }
// }

// console.log(arr);

// c___________________________________________________________________

// let arr = [];
// for (let i = 1; i <= 20; i++) {
//  arr.push(Math.round(Math.random() * 100))
// }

// console.log(arr);

// d_________________________________________________________________________

// let arr = [];
// for (let i = 1; i <= 20; i++) {
//   arr.push(Math.round(Math.random() * (732 - 8) + 8))
// }

// console.log(arr);

// 5. Вивести кожен елемент масиву, сусід справа якого є парним

//  const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// console.log(arr);

//  for(let i = 0; i <= arr.length-1; i++){
//    if(arr[i + 1] % 2 === 0){
//      console.log(arr[i])
//    }
//  }



